const book1 = {
  id: 1,
  title: 'Война и мир',
  authors: 'Лев Николаевич Толстой',
  description:
    'Роман-эпопея Льва Николаевича Толстого, описывающий русское общество в эпоху войн ' +
    'против Наполеона в 1805—1812 годах. Эпилог романа доводит повествование до 1820 года.',
  favorite: 100,
  fileNameCover: 'Лев Николаевич Толстой - Война и мир.jpg',
  fileOriginalCover: 'Война и мир.jpg',
  fileNameBook: 'Лев Николаевич Толстой - Война и мир.txt',
  fileOriginalBook: 'Война и мир.txt'
}

const book2 = {
  id: 2,
  title: 'JavaScript для чайников',
  authors: 'Крис Минник и Ева Холланд',
  description:
    'JavaScript - это ключевой инструмент для создания современных веб-сайтов, ' +
    'и с помощью этой книги, ориентированной на новичков, ' +
    'вы сможете выучить язык в короткие сроки с минимальными усилиями.',
  favorite: 70,
  fileNameCover: 'Крис Минник и Ева Холланд - JavaScript для чайников.jpg',
  fileOriginalCover: 'JavaScript для чайников.jpg',
  fileNameBook: 'Крис Минник и Ева Холланд - JavaScript для чайников.txt',
  fileOriginalBook: 'JavaScript для чайников.txt'
}

const book3 = {
  id: 3,
  title: 'Туда и обратно',
  authors: 'Джон Р. Р. Толкин',
  description:
    'Путешествие хоббита Бильбо Бэггинса, волшебника Гэндальфа ' +
    'и тринадцати гномов во главе с Торином Дубощитом',
  favorite: 60,
  fileNameCover: 'Джон Р. Р. Толкин - Туда и обратно.jpg',
  fileOriginalCover: 'Туда и обратно.jpg',
  fileNameBook: 'Джон Р. Р. Толкин - Туда и обратно.fb2',
  fileOriginalBook: 'Туда и обратно.fb2'
}

// при создании новой книги 
const book4 = {
  title: 'Государство',
  authors: 'Платон',
  description:
    'Диалог Платона, посвящённый проблеме идеального государства. ' +
    'Написан в 360 г. до н. э. С точки зрения Платона, государство ' +
    'является выражением идеи справедливости. В диалоге впервые отчётливо ' +
    'определяются философы как люди, способные постичь то, что вечно тождественно самому себе (идея).',
  favorite: 20,
}

export { book1, book2, book3, book4 }